---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArrArray.Insert(Autodesk.Revit.DB.ModelCurveArray,System.Int32)
source: html/dba1602d-98bd-396d-2502-8c8460b8c669.htm
---
# Autodesk.Revit.DB.ModelCurveArrArray.Insert Method

## Syntax (C#)
```csharp
public virtual void Insert(
	ModelCurveArray item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.ModelCurveArray`)
- **index** (`System.Int32`)